#%取模-返回除法的余数
#// 取整除，返回商的整数部分
'''
a=4
print(type(a))
#a.isdigit()
if not a.isdigit():
    print("ok")
else:
    print("on")
    '''
'''
成员运算
#in如果在指定的序列中找到值返回True，否则返回False
身份运算
is是判断两个标识符是不是引用一个对象
>>> a=[1,2,3,4]
>>> a
[1, 2, 3, 4]
>>> type(a) is list
True
>>> type(23213) is int
True
二进制运算
128  64  32  16  8   4   2
0     0   1   1  1   1   0  =60
0     0   0   0  1   1   0   =13
or或运算 |
---------------------------------------------
0      0   1  1   1  1   0  =61
and于运算   &
----------------------------------------------
0       0   0  0  1   1   0  =12


'''







